// 1) რა განსხვავებაა let, const შორის?
// let: მნიშვნელობის გადაწერა (reassign) შესაძლებელია
// const: მნიშვნელობის გადაწერა შეუძლებელია

// 2) რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// Primitive: ცვლადში ინახება პირდაპირ მნიშვნელობა,კოპირებისას იქმნება ახალი, დამოუკიდებელი ასლი.
// Non-primitive: ცვლადში ინახება მისამართი,კოპირებისას ორივე ცვლადი ერთსა და იმავე მისამართს უყურებს.

// 3) რა განსხვავებაა == და === ოპერატორებს შორის?
// ==: ადარებს მხოლოდ მნიშვნელობებს და ავტომატურად ათანაბრებს ტიპებს (მაგ: 5 == '5' არის true)
// ===: ადარებს როგორც მნიშვნელობას, ისე მონაცემის ტიპს (მაგ: 5 === '5' არის false)

// 4)რა ტიპის არის null
//null არის პრიმიტიული ტიპი

// 5)რა განსხვავებაა funtion და = () => {} შორის
// ჩვეულებრივი ფუნქცია (function): აქვს თავისი საკუთარი this დამოკიდებულია იმაზე, თუ ვინ გამოიძახა ფუნქცია
// (() => {}): არ აქვს თავისი this ის this-ს იღებს იმ გარემოდან, სადაც თავად ფუნქცია შეიქმნა და ნაკლებად ძლიერი ფუნქციაა

// 6)რას ნიშნავს callback function?
// ეს არის ფუნქცია, რომელიც გადაეცემა სხვა ფუნქციას არგუმენტის სახით და სრულდება მას შემდეგ, რაც მთავარი ფუნქცია მუშაობას დაასრულებს

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
//map: გარდაქმნის მასივის თითოეულ ელემენტს და აბრუნებს ახალ, იმავე სიგრძის მასივს
// filter: ფილტრავს ელემენტებს მოცემული პირობით და აბრუნებს ახალ, უფრო მოკლე მასივს (ან ცარიელს)
// reduce: მასივის ყველა ელემენტს აჯამებს და დაჰყავს ერთ კონკრეტულ საბოლოო მნიშვნელობამდე (მაგ: რიცხვამდე, ობიექტამდე)

// 8)რა არის Promise?
// ასინქრონული ტიპის ოპერაციებისთვის გამოიყენება Promise-ები. სჭირდება დრო და გვაქვს ან resolve ან  reject

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის
// Promise.all: ელოდება ყველა promise-ის წარმატებით შესრულებას. თუ ერთი მაინც არ შესრულდება, errorს ამოაგდებს
// Promise.race: აბრუნებს იმ promise-ის შედეგს, რომელიც ყველაზე სწრაფად შესრულდება არ აქვს მნიშვნელობა, წარმატებით თუ არა
// Promise.any: ელოდება პირველსავე წარმატებულ promise-ისს თუ არცერთი არ შესრულდება, მხოლოდ მაშინ აბრუნებს errorს

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// async/await საშუალებას გვაძლევს ასინქრონული კოდი დავწეროთ როგორც სინქრონული, რაც კოდს ბევრად უფრო მარტივად წასაკითხს ხდის

// 11)რა განსხვავებაა class-სა და object-ს შორის?
//class: არის შაბლონი,ობიექტების შესაქმნელად.
// object (ობიექტი): არის ამ შაბლონით შექმნილი კონკრეტული Instance რომელსაც მონაცემები აქვს.

// 12)რას აკეთებს constructor class-ში?
//constructor ავტომატურად ეშვება ახალი ობიექტის შექმნისას მისი მთავარი დანიშნულება ობიექტის საწყისი თვისებების ინიციალიზაციაა.

//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
// მემორი სტეკი: სწრაფი და სტრუქტურული მეხსიერებაა, სადაც ინახება პრიმიტიული ცვლადები და ფუნქციების გამოძახების კონტექსტები.
// მემორი ჰიპი : დიდი და არასტრუქტურული მეხსიერებაა, სადაც ინახება რთული მონაცემები — ობიექტები და მასივები.

//14) რა არის ქოლსტეკი
// ეს არის მექანიზმი, რომელიც JavaScript-ს ეხმარება თვალი ადევნოს ფუნქციების შესრულების რიგითობას.რომელი ფუნქციაც ბოლოს შედის სტეკში, ის სრულდება პირველი და ტოვებს სტეკს

//15) რა არის ივენთ ლუპი
// ეს არის მუდმივი ციკლი, რომელიც აკონტროლებს Call Stack-ს და ასინქრონული დავალებების რიგს (Callback Queue). როდესაც Call Stack მთლიანად ცარიელდება, Event Loop-ს რიგიდან გადმოაქვს ასინქრონული ფუნქციები სტეკში შესასრულებლად.

